---
kind: property
id: P:Autodesk.Revit.DB.NurbSpline.Weights
source: html/3cbb6ef9-6234-672a-3705-205b43e1da17.htm
---
# Autodesk.Revit.DB.NurbSpline.Weights Property

Returns the weights of the nurb spline.

## Syntax (C#)
```csharp
public DoubleArray Weights { get; }
```